app/controllers/auth_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "r"], ["LIMIT", 1]]
---
  def login
    @user = User.find_by_email(params[:user][:email].downcase)