app/controllers/inboxes_controller.rb

SELECT "inboxes".* FROM "inboxes" WHERE "inboxes"."user_id" = $1  [["user_id", 3]]
---
  def index
    if logged_in?
      @inboxes = Inbox.where(user: @user)

INSERT INTO "inboxes" ("name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "asfdaf"], ["user_id", 5], ["created_at", "2019-11-05 23:29:17.354379"], ["updated_at", "2019-11-05 23:29:17.354379"]]
---
  def create
    if logged_in?
      @inbox = Inbox.new(name: inbox_params[:name], user:@user)

      if @inbox.save

UPDATE "inboxes" SET "name" = $1, "updated_at" = $2 WHERE "inboxes"."id" = $3  [["name", "Email2"], ["updated_at", "2019-11-05 22:08:37.522062"], ["id", 1]]
---
  def update
    if logged_in?
      if @inbox.update(name: inbox_params[:name], user:@user)

SELECT "items".* FROM "items" WHERE "items"."inbox_id" = $1  [["inbox_id", 6]]
UPDATE "items" SET "inbox_id" = $1, "updated_at" = $2 WHERE "items"."id" = $3  [["inbox_id", 4], ["updated_at", "2019-11-06 00:38:49.560217"], ["id", 5]]
DELETE FROM "inboxes" WHERE "inboxes"."id" = $1  [["id", 6]]
DELETE FROM "items" WHERE "items"."id" = $1  [["id", 2]]
---
  def destroy
    if logged_in? && @inbox.user == current_user
      @inbox.items.each do |item|
        item.update(inbox: @default)
      end
      @inbox.destroy

SELECT  "inboxes".* FROM "inboxes" WHERE "inboxes"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
    def set_inbox
      @inbox = Inbox.find(params[:id])

SELECT  "inboxes".* FROM "inboxes" WHERE "inboxes"."user_id" = $1 AND "inboxes"."name" = $2 ORDER BY "inboxes"."id" ASC LIMIT $3  [["user_id", 5], ["name", "Default"], ["LIMIT", 1]]
---
    def set_default_inbox
      @default = Inbox.where(user: @user, name: "Default").first