app/controllers/inboxes_controller.rb

SELECT "items".* FROM "items" WHERE "items"."inbox_id" = $1  [["inbox_id", 4]]
---
    def set_item
      if params[:item] != nil
        item = Item.find(params[:item])