app/controllers/items_controller.rb

SELECT "inboxes".* FROM "inboxes" WHERE "inboxes"."user_id" = $1  [["user_id", 5]]
---
  def new
    if logged_in?
      @item = Item.new
      @inboxes = Inbox.where(user: @user)

SELECT "inboxes".* FROM "inboxes" WHERE "inboxes"."user_id" = $1  [["user_id", 5]]
---
  def edit
    if !(logged_in? && @item.inbox.user == current_user)
      redirect_to login_path
    else
      @inboxes = Inbox.where(user: @user)

INSERT INTO "items" ("name", "content", "inbox_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "dasf"], ["content", "dsafdsa"], ["inbox_id", 6], ["created_at", "2019-11-05 23:28:18.816570"], ["updated_at", "2019-11-05 23:28:18.816570"]]
---
  def create
    if logged_in?
      @item = Item.new(item_params)

      if @item.save

UPDATE "items" SET "inbox_id" = $1, "updated_at" = $2 WHERE "items"."id" = $3  [["inbox_id", 5], ["updated_at", "2019-11-05 23:25:06.472041"], ["id", 1]]
---
  def update
    if logged_in?
      if @item.update(item_params)

SELECT  "inboxes".* FROM "inboxes" WHERE "inboxes"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
    def set_inbox
      if params.has_key?(:inbox_id)
        @inbox = Inbox.find(params[:inbox_id])

SELECT  "inboxes".* FROM "inboxes" WHERE "inboxes"."user_id" = $1 AND "inboxes"."name" = $2 ORDER BY "inboxes"."id" ASC LIMIT $3  [["user_id", 5], ["name", "Default"], ["LIMIT", 1]]
---
    def set_default_inbox
      @default = Inbox.where(user: @user, name: "Default").first